[
  {
    "chapter": 2,
    "verse_number": 62,
    "subject": "Root Cause of Anger",
    "verse": {
      "en": "Dhyayato vishayan pumsah sangas tesupajayate | Sangat sanjayate kamah kamat krodho abhijayate ||",
      "hi": "ध्यायतो विषयान् पुंसः सङ्गस्तेषूपजायते। सङ्गात् सञ्जायते कामः कामात् क्रोधोऽभिजायते॥"
    },
    "meaning": {
      "en": "When a person constantly thinks about material desires, attachment develops. From attachment, desire arises, and when desires are unfulfilled, anger is born. Anger leads to confusion and destruction.",
      "hi": "जब व्यक्ति लगातार भौतिक इच्छाओं के बारे में सोचता है, तो लगाव पैदा होता है। लगाव से इच्छा पैदा होती है, और जब इच्छाएं पूरी नहीं होतीं, तो क्रोध पैदा होता है। क्रोध भ्रम और विनाश का कारण बनता है।"
    },
    "explanation": {
      "en": "Anger and resentment stem from unfulfilled desires and attachments. When we cling to outcomes or material possessions, we set ourselves up for frustration. Lord Krishna teaches that attachment to desires is the root cause of anger.",
      "hi": "क्रोध और असंतोष अधूरी इच्छाओं और लगाव से उत्पन्न होते हैं। जब हम परिणामों या भौतिक संपत्ति से चिपके रहते हैं, तो हम खुद को निराशा के लिए तैयार करते हैं। भगवान कृष्ण सिखाते हैं कि इच्छाओं से लगाव क्रोध का मूल कारण है।"
    },
    "solution": {
      "en": "Practice detachment from outcomes. Focus on your efforts without being overly attached to results. Reflect on whether your desires are necessary or if they are causing unnecessary stress. Cultivate contentment and gratitude for what you already have.",
      "hi": "परिणामों से अलग रहने का अभ्यास करें। परिणामों से अत्यधिक जुड़े बिना अपने प्रयासों पर ध्यान दें। यह प्रतिबिंबित करें कि क्या आपकी इच्छाएं आवश्यक हैं या वे अनावश्यक तनाव पैदा कर रही हैं। जो आपके पास पहले से है, उसके लिए संतोष और कृतज्ञता विकसित करें।"
    }
  },
  {
    "chapter": 2,
    "verse_number": 14,
    "subject": "Cultivate Equanimity",
    "verse": {
      "en": "Matra-sparshas tu kaunteya shitoshna-sukha-duhkha-dah | Agamapayino anityas tams titiksasva bharata ||",
      "hi": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः। आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥"
    },
    "meaning": {
      "en": "Pleasure and pain, heat and cold, are temporary and come and go like seasons. Learn to endure them without being disturbed.",
      "hi": "सुख और दुख, गर्मी और सर्दी, अस्थायी हैं और मौसम की तरह आते-जाते रहते हैं। उन्हें बिना विचलित हुए सहने का अभ्यास करें।"
    },
    "explanation": {
      "en": "Life is full of ups and downs, and anger often arises when we resist these natural changes. Lord Krishna advises us to remain steady and patient, knowing that all emotions and situations are temporary.",
      "hi": "जीवन उतार-चढ़ाव से भरा है, और क्रोध अक्सर तब पैदा होता है जब हम इन प्राकृतिक परिवर्तनों का विरोध करते हैं। भगवान कृष्ण हमें स्थिर और धैर्यवान रहने की सलाह देते हैं, यह जानते हुए कि सभी भावनाएं और स्थितियां अस्थायी हैं।"
    },
    "solution": {
      "en": "When anger arises, pause and remind yourself that this feeling is temporary. Practice deep breathing or meditation to calm your mind. Develop a habit of observing your emotions without reacting impulsively.",
      "hi": "जब क्रोध उत्पन्न हो, तो रुकें और खुद को याद दिलाएं कि यह भावना अस्थायी है। अपने मन को शांत करने के लिए गहरी सांस लेने या ध्यान का अभ्यास करें। बिना आवेग में आए अपनी भावनाओं को देखने की आदत विकसित करें।"
    }
  },
  {
    "chapter": 6,
    "verse_number": 5,
    "subject": "Control the Mind",
    "verse": {
      "en": "Uddhared atmanatmanam natmanam avasadayet | Atmaiva hy atmano bandhur atmaiva ripur atmanah ||",
      "hi": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥"
    },
    "meaning": {
      "en": "Elevate yourself by your own mind; do not degrade yourself. The mind can be your best friend or your worst enemy.",
      "hi": "अपने मन से खुद को ऊपर उठाएं; खुद को नीचे न गिराएं। मन आपका सबसे अच्छा दोस्त या सबसे बड़ा दुश्मन हो सकता है।"
    },
    "explanation": {
      "en": "The mind has the power to either uplift or destroy us. Anger and resentment arise when we let the mind control us instead of us controlling the mind.",
      "hi": "मन में हमें ऊपर उठाने या नष्ट करने की शक्ति होती है। क्रोध और असंतोष तब पैदा होते हैं जब हम मन को हमें नियंत्रित करने देते हैं, बजाय इसके कि हम मन को नियंत्रित करें।"
    },
    "solution": {
      "en": "Practice mindfulness and self-awareness. Observe your thoughts without judgment. Replace negative thoughts with positive affirmations or prayers. Engage in activities that calm the mind, such as yoga, meditation, or chanting.",
      "hi": "माइंडफुलनेस और आत्म-जागरूकता का अभ्यास करें। बिना निर्णय के अपने विचारों को देखें। नकारात्मक विचारों को सकारात्मक पुष्टि या प्रार्थना से बदलें। ऐसी गतिविधियों में शामिल हों जो मन को शांत करती हैं, जैसे योग, ध्यान या जप।"
    }
  },
  {
    "chapter": 18,
    "verse_number": 66,
    "subject": "Surrender to the Divine",
    "verse": {
      "en": "Sarva-dharman parityajya mam ekam sharanam vraja | Aham tvam sarva-papebhyo mokshayishyami ma suchah ||",
      "hi": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥"
    },
    "meaning": {
      "en": "Abandon all varieties of duties and surrender unto Me alone. I shall liberate you from all sins and sorrows; do not fear.",
      "hi": "सभी प्रकार के कर्तव्यों को त्याग दें और केवल मेरी शरण में आएं। मैं तुम्हें सभी पापों और दुखों से मुक्त कर दूंगा; डरो मत।"
    },
    "explanation": {
      "en": "Lord Krishna assures that surrendering to the Divine and trusting in a higher power can free us from negative emotions like anger and resentment. Letting go of ego and control helps us find peace.",
      "hi": "भगवान कृष्ण आश्वासन देते हैं कि दिव्यता के प्रति समर्पण और एक उच्च शक्ति में विश्वास हमें क्रोध और असंतोष जैसी नकारात्मक भावनाओं से मुक्त कर सकता है। अहंकार और नियंत्रण को छोड़ने से हमें शांति मिलती है।"
    },
    "solution": {
      "en": "Surrender your worries and anger to God through prayer or meditation. Trust that everything happens for a reason and that the Divine is guiding you. Practice humility and let go of the need to control every situation.",
      "hi": "प्रार्थना या ध्यान के माध्यम से अपनी चिंताओं और क्रोध को भगवान के प्रति समर्पित करें। विश्वास करें कि सब कुछ एक कारण से होता है और दिव्यता आपका मार्गदर्शन कर रही है। विनम्रता का अभ्यास करें और हर स्थिति को नियंत्रित करने की आवश्यकता को छोड़ दें।"
    }
  },
  {
    "chapter": 16,
    "verse_number": 3,
    "subject": "Practice Forgiveness",
    "verse": {
      "en": "Ahimsa satyam akrodhas tyagah shantir apaisunam | Daya bhuteshv aloluptvam mardavam hrir achapalam ||",
      "hi": "अहिंसा सत्यमक्रोधस्त्यागः शान्तिरपैशुनम्। दया भूतेष्वलोलुप्त्वं मार्दवं ह्रीरचापलम्॥"
    },
    "meaning": {
      "en": "Non-violence, truthfulness, absence of anger, renunciation, peacefulness, compassion, and humility are qualities of a divine nature.",
      "hi": "अहिंसा, सत्य, क्रोध का अभाव, त्याग, शांति, करुणा और विनम्रता दिव्य प्रकृति के गुण हैं।"
    },
    "explanation": {
      "en": "Lord Krishna emphasizes that forgiveness, compassion, and letting go of anger are divine qualities. Holding onto resentment only harms us, while forgiveness liberates us.",
      "hi": "भगवान कृष्ण जोर देते हैं कि क्षमा, करुणा और क्रोध को छोड़ना दिव्य गुण हैं। असंतोष को पकड़े रहना केवल हमें नुकसान पहुंचाता है, जबकि क्षमा हमें मुक्त करती है।"
    },
    "solution": {
      "en": "Practice forgiving others and yourself. Holding onto resentment only hurts you. Reflect on the fact that everyone is acting according to their own level of understanding. Replace anger with empathy and understanding.",
      "hi": "दूसरों और खुद को माफ करने का अभ्यास करें। असंतोष को पकड़े रहना केवल आपको चोट पहुंचाता है। इस तथ्य पर विचार करें कि हर कोई अपनी समझ के स्तर के अनुसार कार्य कर रहा है। क्रोध को सहानुभूति और समझ से बदलें।"
    }
  }
]
